# =============================================================================
# Homebrew Bundle
# https://docs.brew.sh/Manpage#bundle-subcommand
# =============================================================================

# Taps
tap "atlassian/acli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Core Utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "gmp"
brew "openssh"
brew "screen"

# Shells & Completion
brew "bash"
brew "bash-completion2"
brew "zsh-syntax-highlighting"

# Development Tools
brew "mise"
brew "luarocks"

# Git tools
brew "gh"
brew "glab"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "yadm"

# Text editors
brew "neovim"
brew "vim"

# Code formatters & linters
brew "ktlint"
brew "swiftformat"
brew "prettier"
brew "markdownlint-cli2"
brew "ast-grep"

# CLI Utilities
brew "ack"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "ssh-copy-id"
brew "thefuck"
brew "tree"
brew "vbindiff"
brew "wget"
brew "zopfli"
brew "glances"

# System & Monitoring
brew "fastfetch"

# Multimedia
brew "ffmpeg"
brew "imagemagick"
brew "ghostscript"
brew "mermaid-cli"

# Font tools
brew "sfnt2woff-zopfli"
brew "woff2"

# Network & Web
brew "curl"
brew "lynx"

# GPG & Security
brew "gnupg"

# Terminals
cask "iterm2"

# Window management
cask "alt-tab"
cask "rectangle"

# Communication
cask "slack"

# Media
cask "spotify"
cask "vlc"

# Development
cask "bruno"
cask "jetbrains-toolbox"
brew "scrcpy"

# Browsers
cask "zen-browser"

# Launchers & tools
cask "raycast"
cask "boring-notch"
cask "caffeine"
cask "1password"

# Fonts
cask "font-jetbrains-mono"
